; domain
;; Source: https://github.com/josej30/Planner-Sat-Constraints

(define (domain logistics)

(:requirements :strips :typing) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location ?c - city)
         :precondition  (and (at ?t ?from)
                             (in-city ?from ?c)
                             (in-city ?to ?c))
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s1-p8-a4)

(:domain logistics)

(:objects a0 a1 a2 a3 - airplane
          c0 c1 - city
          t0 t1 t2 t3 t4 t5 t6 t7 t8 - truck
          l0-0 l1-0 - airport
          p0 p1 p2 p3 p4 p5 p6 p7 - package
)

(:init
    (in-city  l0-0 c0)
    (in-city  l1-0 c1)
    (at t0 l0-0)
    (at t1 l1-0)
    (at t2 l1-0)
    (at t3 l1-0)
    (at t4 l0-0)
    (at t5 l0-0)
    (at t6 l1-0)
    (at t7 l0-0)
    (at t8 l0-0)
    (at p0 l1-0)
    (at p1 l1-0)
    (at p2 l1-0)
    (at p3 l0-0)
    (at p4 l0-0)
    (at p5 l1-0)
    (at p6 l0-0)
    (at p7 l0-0)
    (at a0 l0-0)
    (at a1 l0-0)
    (at a2 l0-0)
    (at a3 l0-0)
)

(:goal
    (and
        (at p0 l0-0)
        (at p1 l1-0)
        (at p2 l1-0)
        (at p3 l0-0)
        (at p4 l1-0)
        (at p5 l1-0)
        (at p6 l1-0)
        (at p7 l0-0)
    )
)
)

; plan
1. (fly a1 l0-0 l1-0)
   deleted: (at a1 l0-0)
   added: (at a1 l1-0)
   goals met: 5 of 8
2. (fly a3 l0-0 l1-0)
   deleted: (at a3 l0-0)
   added: (at a3 l1-0)
   goals met: 5 of 8
3. (load a0 p4 l0-0)
   deleted: (at p4 l0-0)
   added: (in p4 a0)
   goals met: 5 of 8
4. (load a0 p6 l0-0)
   deleted: (at p6 l0-0)
   added: (in p6 a0)
   goals met: 5 of 8
5. (load t0 p3 l0-0)
   deleted: (at p3 l0-0)
   added: (in p3 t0)
   goals met: 4 of 8
6. (load t0 p7 l0-0)
   deleted: (at p7 l0-0)
   added: (in p7 t0)
   goals met: 3 of 8
7. (load t1 p1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 t1)
   goals met: 2 of 8
8. (load t1 p2 l1-0)
   deleted: (at p2 l1-0)
   added: (in p2 t1)
   goals met: 1 of 8
9. (load t1 p5 l1-0)
   deleted: (at p5 l1-0)
   added: (in p5 t1)
   goals met: 0 of 8
10. (fly a2 l0-0 l1-0)
   deleted: (at a2 l0-0)
   added: (at a2 l1-0)
   goals met: 0 of 8
11. (fly a3 l1-0 l0-0)
   deleted: (at a3 l1-0)
   added: (at a3 l0-0)
   goals met: 0 of 8
12. (load a1 p0 l1-0)
   deleted: (at p0 l1-0)
   added: (in p0 a1)
   goals met: 0 of 8
13. (fly a0 l0-0 l1-0)
   deleted: (at a0 l0-0)
   added: (at a0 l1-0)
   goals met: 0 of 8
14. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 0 of 8
15. (unload a0 p4 l1-0)
   deleted: (in p4 a0)
   added: (at p4 l1-0)
   goals met: 1 of 8
16. (unload a0 p6 l1-0)
   deleted: (in p6 a0)
   added: (at p6 l1-0)
   goals met: 2 of 8
17. (unload a1 p0 l0-0)
   deleted: (in p0 a1)
   added: (at p0 l0-0)
   goals met: 3 of 8
18. (unload t0 p3 l0-0)
   deleted: (in p3 t0)
   added: (at p3 l0-0)
   goals met: 4 of 8
19. (unload t0 p7 l0-0)
   deleted: (in p7 t0)
   added: (at p7 l0-0)
   goals met: 5 of 8
20. (unload t1 p1 l1-0)
   deleted: (in p1 t1)
   added: (at p1 l1-0)
   goals met: 6 of 8
21. (unload t1 p2 l1-0)
   deleted: (in p2 t1)
   added: (at p2 l1-0)
   goals met: 7 of 8
22. (unload t1 p5 l1-0)
   deleted: (in p5 t1)
   added: (at p5 l1-0)
   goals met: 8 of 8
